## Table of contents
<ul>
    <li>01. Importing libraries</li>
    <li>02. Importing data</li>
    <li>03. Creating Mixed Data Types</li>
    <li>04. Find missing values</li>
    <li>05. Tidying up and exporting</li>
    <li>06. Task</li>

</ul>

## 01. Importing libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

## 02. Importing data

In [2]:
path  = r'<YOURPATH>' #Important: No \ at the end!

In [7]:
# Importing FILENAME.csv from local path as df_prods
df_prods = pd.read_csv(os.path.join(path, 'sub-folder','sub-sub-folder', 'yourfilename.csv'), index_col = False)

In [3]:
# Importing FILENAME_2.csv from local path as df_ords
df_ords = pd.read_csv(os.path.join(path, 'sub-folder','sub-sub-folder', 'yourfilename.csv'), index_col = False)

In [4]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [6]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [7]:
#Removing unnamed column
df_ords = df_ords.drop(columns=[col for col in df_ords.columns if 'Unnamed' in col])

In [8]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

## 03. Creating Mixed Data Types

In [24]:
#Create a test dataframe
df_test = pd.DataFrame()

In [25]:
df_test.head()

Empty DataFrame
Columns: []
Index: []

In [27]:
df_test['mix'] =['a', 'b', 1, True]

In [28]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [31]:
# Check for mixed types 
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [33]:
# Change mixed type to one type - in this case string
df_test['mix'] = df_test['mix'].astype('str')

## 04. Find missing values

In [36]:
#find missing values in df_prod
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [37]:
#create new dataframe with only missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [38]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [39]:
df_prods.shape

(49693, 5)

In [40]:
#create new dataframe with no missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [41]:
df_prods_clean.shape

(49677, 5)

In [42]:
df_prods_clean.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [43]:
#Identify full duplicates within the dataframe
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [48]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [46]:
#Trying to understand better where the duplicates are in the database
df_prods_clean[df_prods_clean['product_name']=='Ranger IPA']

       product_id product_name  aisle_id  department_id  prices
18458       18458   Ranger IPA        27              5     9.2
18459       18458   Ranger IPA        27              5     9.2

In [47]:
df_prods_clean[df_prods_clean['product_name']=='Fiber 4g Gummy Dietary Supplement']

,product_id,product_name,aisle_id,department_id,prices
461,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8

Reminder that first column is index. Increase in index is not consistent with increase in product_id in duplicates - most likely because of the duplicates. That is not a contradiction. Python seems to identify the second occurence of an entry as the duplicate and the first as the original.

In [52]:
df_prods_clean.shape

(49677, 5)

In [53]:
#Removing duplicates from df_prods_clean
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [54]:
df_prods_clean_no_dups.shape

(49672, 5)

## 05. Tidying up and exporting

In [55]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'), index = False)

## 06. Task

**2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.**!

In [9]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

- I intially thought that 25% value of order_id looked weird but then realised it was +05 instead of +06
- The maximum number of orders (100) is most likely an outlier, given that 75% of customers ordered 23 or fewer times.
- It is unclear to me how the mean for orders_dow is calculated
- It is suprising that none of the customers have a max days_since_last_order of >30. This could imply a subscription model.

**3. Check for mixed-type data in your df_ords dataframe.**

In [14]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

**4. If you find mixed-type data, fix it. The column in question should contain observations of a single data type.**

There is no mixed-type data in df_ords.

**5. Run a check for missing values in your df_ords dataframe.
In a markdown cell, report your findings and propose an explanation for any missing values you find**.

In [10]:
df_ords.isnull().sum()

order_id                      0
user_id                       0
order_number                  0
orders_day_of_week            0
order_hour_of_day             0
days_since_last_order    206209
dtype: int64

Given that Instacart has a total of 206209 customer-IDs it seems most likely that NaN is the value assigned during their first order since there is no previous order.

**6. Address the missing values using an appropriate method. 
In a markdown cell, explain why you used your method of choice**
.

Given that we have established that the NaN represents the first order of each customer we should <i>not</i> remove those entries because the first order of a customer is relevant. Imputing values would skew the dataset. Thus I will leave the values as they are.

In [13]:
df_ords.shape

(3421083, 6)

**7. Run a check for duplicate values in your df_ords data.
In a markdown cell, report your findings and propose an explanation for any duplicate values you find**.

In [14]:
df_dups = df_ords[df_ords.duplicated()]

In [19]:
df_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_last_order]
Index: []

In [74]:
df_ords_nonan.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,11.11484
1,2398795,1,2,3,7,15.00000
2,473747,1,3,3,12,21.00000
3,2254736,1,4,4,7,29.00000
4,431534,1,5,4,15,28.00000

There are no duplicate values. Probably because order_id is assigned automatically and something would have to be seriously wrong for the same order_id to be assigned twice.

**8. Address the duplicates using an appropriate method.
In a markdown cell, explain why you used your method of choice**.

There are no duplicate values.

**9. Export**

In [20]:
df_ords_nonan.to_csv(os.path.join(path, 'sub-folder','sub-sub-folder', 'yourfilename.csv'), index=False)